{
  "job": "Ingénieur Logiciel IA",
  "specialisation": "Data & Web",
  "hi": "Salut, je suis Aristide !",
  "welcome": "Bienvenue sur ma page web.",
  "presentation": "Ingénieur depuis trois ans, je suis spécialisé dans le développement de données et web.",
  "passionateDescription": "Passionné par la création de solutions innovantes qui comblent le fossé entre la science des données et le développement web.",
  "viewMyWork": "Voir mon travail",
  "skillsTitle": "Compétences & Technologies",
  "categoryLabel": "Catégorie",
  "allCategories": "Toutes les catégories",
  "minScoreLabel": "Score minimum",
  "anyScore": "Tout score",
  "sortByLabel": "Trier par",
  "nameSort": "Nom",
  "scoreSort": "Score",
  "orderLabel": "Ordre",
  "ascending": "Croissant",
  "descending": "Décroissant",
  "showingSkills": "Affichage de {{count}} sur {{total}} compétences",
  "luckyNumber": "Chance #{{score}}",
  "dataEngineering": "Ingénierie des données",
  "webDevelopment": "Développement web",
  "uiUxDesign": "Design UI/UX",
  "machineLearning": "Apprentissage automatique",
  "workExperienceTitle": "Expérience professionnelle",
  "workExperienceDescription": "Un voyage chronologique à travers mon expérience professionnelle et mes principales réalisations",
  "getInTouch": "Me contacter",
  "works": [
    {
      "name": "VisionForge",
      "company": "CapGemini",
      "role": "Leader technique",
      "location": "Brest",
      "start_date": "06/2025",
      "end_date": null,
      "description": "Application collaborative permettant de gérer, entraîner et suivre des modèles de machine learning : organisation des jeux de données, configuration des entraînements, visualisation des performances, collaboration en temps réel et déploiement simplifié des modèles, le tout sur une architecture microservices scalable adaptée aux infrastructures d’entreprise.",
      "context": "Faciliter l’accès à l’intelligence artificielle au sein de l’entreprise en sensibilisant les équipes à ses usages, en démocratisant les outils IA et en favorisant leur adoption. L’objectif est d’accroître la productivité grâce à des solutions d’IA adaptées aux besoins métiers, tout en accompagnant la transformation des pratiques internes.",
      "tasks": [
        "Conception et amélioration de l'expérience utilisateur et de l'interface graphique pour rendre l'application intuitive et accessible",
        "Déploiement de l'application sur AWS, gestion des environnements de production et staging, automatisation des mises à jour",
        "Mise en place et maintenance des pipelines d'intégration et de déploiement continu pour automatiser tests, build et déploiement",
        "Développement des interfaces utilisateur, intégration des composants et interaction avec l'API backend",
        "Refactorisation et optimisation du code pour améliorer sa lisibilité, maintenabilité et performances",
        "Sélection des technologies et architectures adaptées aux besoins métiers et contraintes techniques",
        "Création et gestion de conteneurs pour assurer portabilité, isolation et scalabilité des services",
        "Conception et mise en place d'une architecture microservices pour modulariser l'application et faciliter son évolutivité"
      ],
      "skills": [
        "Git",
        "Python",
        "Poetry",
        "React",
        "REST APIs",
        "TypeScript",
        "AWS",
        "Docker",
        "FastAPI",
        "Figma",
        "MongoDB",
        "UX Design",
        "Microservices",
        "Node.Js",
        "WebSocket"
      ]
    },
    {
      "name": "DocSentinel",
      "company": "CapGemini",
      "role": "Leader technique",
      "location": "Brest",
      "start_date": "06/2025",
      "end_date": null,
      "context": "Faciliter le traitement et l’analyse de documents professionnels pour les clients, en offrant une solution basée sur l’intelligence artificielle directement utilisable sur leurs infrastructures, même dans des environnements restreints. L’objectif est de simplifier les flux documentaires, gagner du temps et améliorer la productivité des équipes.",
      "description": "Application utilisant l’intelligence artificielle générative pour valider et corriger des documents professionnels. Elle identifie les erreurs, propose des corrections automatiques et effectue une validation des contenus pour réduire les tâches manuelles répétitives.",
      "tasks": [
        "Analyse des besoins utilisateurs et réflexion approfondie sur l'UI/UX pour garantir une expérience fluide et moderne.",
        "Conception de l’architecture globale de l’application (organisation du projet, modules, services et modèles de données).",
        "Étude et sélection du stack technique (frameworks front et back, base de données, outils DevOps, services tiers).",
        "Identification des problèmes fonctionnels et techniques, analyse de leurs impacts et recherche de solutions adaptées.",
        "Développement backend incluant la logique métier, la gestion des données, la sécurité et les validations.",
        "Développement frontend avec intégration du design et responsive design.",
        "Conception, développement et documentation de l’API REST (endpoints, authentification, tests).",
        "Intégration d’IA générative via SLM et LLM (choix du modèle, intégration API, optimisation des prompts et sécurité).",
        "Mise en place du pipeline de déploiement, configuration des environnements, hébergement et monitoring.",
        "Revue de code systématique pour garantir la qualité, la maintenabilité et la cohérence du codebase.",
        "Définition et mise en application des standards de qualité, bonnes pratiques et règles de sécurité à respecter.",
        "Accompagnement et montée en compétence de l’équipe technique sur le stack technique, les outils et les méthodologies."
      ],
      "skills": [
        "Git",
        "Python",
        "Poetry",
        "React",
        "REST APIs",
        "TypeScript",
        "Docker",
        "FastAPI",
        "Figma",
        "UX Design",
        "Node.Js",
        "WebSocket"
      ]
    },
    {
      "name": "DrawingValidation",
      "company": "CapGemini",
      "role": "Leader technique",
      "location": "Brest",
      "start_date": "06/2025",
      "end_date": null,
      "context": "Faciliter le traitement et l’analyse de documents professionnels pour les clients, en offrant une solution basée sur l’intelligence artificielle directement utilisable sur leurs infrastructures, même dans des environnements restreints. L’objectif est de simplifier les flux documentaires, gagner du temps et améliorer la productivité des équipes.",
      "description": "Application utilisant l’intelligence artificielle pour analyser des documents professionnels. Elle extrait les informations importantes, les structure et effectue une validation automatique pour réduire les tâches manuelles répétitives.",
      "tasks": [
        "Analyse des besoins utilisateurs et réflexion approfondie sur l'UI/UX pour garantir une expérience fluide et moderne.",
        "Conception de l’architecture globale de l’application (organisation du projet, modules, services et modèles de données).",
        "Étude et sélection du stack technique (frameworks front et back, base de données, outils DevOps, services tiers).",
        "Identification des problèmes fonctionnels et techniques, analyse de leurs impacts et recherche de solutions adaptées.",
        "Développement backend incluant la logique métier, la gestion des données, la sécurité et les validations.",
        "Développement frontend avec intégration du design et responsive design.",
        "Conception, développement et documentation de l’API REST (endpoints, authentification, tests).",
        "Intégration d’IA générative via SLM et LLM (choix du modèle, intégration API, optimisation des prompts et sécurité).",
        "Mise en place du pipeline de déploiement, configuration des environnements, hébergement et monitoring.",
        "Revue de code systématique pour garantir la qualité, la maintenabilité et la cohérence du codebase.",
        "Définition et mise en application des standards de qualité, bonnes pratiques et règles de sécurité à respecter.",
        "Accompagnement et montée en compétence de l’équipe technique sur le stack technique, les outils et les méthodologies."
      ],
      "skills": [
        "Git",
        "Python",
        "Poetry",
        "React",
        "REST APIs",
        "TypeScript",
        "Docker",
        "FastAPI",
        "Figma",
        "UX Design",
        "Node.Js",
        "WebSocket"
      ]
    },
    {
      "name": "TechPub",
      "company": "CapGemini",
      "role": "Développeur full-stack",
      "location": "Brest",
      "start_date": "06/2025",
      "end_date": "06/2025",
      "context": "Comparer rapidement et précisément des documents sensibles ou restreints afin d'optimiser les flux métier et réduire le temps consacré à l’analyse et à la vérification des contenus, tout en maintenant un niveau élevé de sécurité et de confidentialité, dans une infrastructure cloisonnée.",
      "description": "Application intuitive permettant une comparaison rapide de documents sensibles ou restreints, avec détection automatique des différences, synthèse des modifications et protection renforcée de la confidentialité à chaque étape.",
      "tasks": [
        "Modernisation complète du design selon les meilleures pratiques UI/UX.",
        "Système de design cohérent et hiérarchie visuelle améliorée.",
        "Refonte complète du frontend en React, incluant la réorganisation des composants, l'optimisation des performances, l'implémentation d'un routage moderne et la mise en place d'une architecture modulable et maintenable.",
        "Mises à jour de l'API pour supporter les nouvelles fonctionnalités frontend."
      ],
      "skills": [
        "Git",
        "Python",
        "Poetry",
        "React",
        "REST APIs",
        "TypeScript",
        "FastAPI",
        "Node.Js",
        "WebSocket"
      ]
    },
    {
      "name": "Mediation",
      "company": "Orange",
      "role": "Ingénieur de données",
      "location": "Brest",
      "start_date": "08/2023",
      "end_date": "04/2025",
      "context": "Maintenance et amélioration d'un data center.",
      "tasks": [
        "Développement et déploiement de pipelines de données mobiles.",
        "Migration vers le cloud.",
        "Équipe de trois personnes en agile KAMBAN.",
        "Maintenance et amélioration d'un pipeline ETL pour le traitement de données mobiles."
      ],
      "skills": ["Flink", "Hadoop", "Kafka", "Spark", "Git", "Gcp", "Scala"]
    },
    {
      "name": "Atawey",
      "company": "Atawey",
      "role": "Ingénieur de données",
      "location": "Brest",
      "start_date": "08/2023",
      "end_date": "09/2023",
      "context": "comprendre et anticiper la consommation électrique d’une borne de recharge pour véhicules à hydrogène, en prenant en compte les variations liées à l’utilisation réelle, aux conditions environnementales et aux spécificités techniques de la borne. L’objectif est de disposer de données fiables pour améliorer l’efficacité énergétique, optimiser les coûts d’exploitation et soutenir le développement de modèles prédictifs capables d’analyser et d’estimer la consommation dans différentes conditions.",
      "description": "Conception et mise en place d’un pipeline de traitement de données en Python, destiné à collecter, nettoyer et structurer les données issues des bornes de recharge. Le pipeline prépare les informations nécessaires à l’entraînement d’un modèle de machine learning capable d’estimer et d’analyser la consommation électrique selon différents paramètres. Il assure un traitement fiable et continu des flux, garantissant des données exploitables pour des analyses précises et des décisions optimisées en matière de gestion énergétique.",
      "tasks": [
        "Développement d'une application web pour la visualisation de données.",
        "Équipe de trois personnes en agile SCRUM.",
        "Communication en anglais.",
        "Développement d'un pipeline ETL avant l'application d'un modèle d'IA chargé d'isoler la consommation énergétique d'une station de recharge de voiture à hydrogène."
      ],
      "skills": [
        "backend",
        "dask",
        "pipeline de données",
        "anglais",
        "etl",
        "frontend",
        "git",
        "python",
        "scrum"
      ]
    },
    {
      "name": null,
      "company": "Orange",
      "role": "Ingénieur de données",
      "location": "Lannion",
      "start_date": "10/2021",
      "end_date": "10/2022 ",
      "context": "Nécessité de traiter de gros volumes de données issus des routeurs de réseau mobile, avec des contraintes strictes de temporalité, de vitesse de traitement et de stockage, afin d’assurer une exploitation fiable et rapide des informations réseaus.",
      "description": "Mise en place d’un pipeline de traitement de données modulable et scalable, capable de gérer de grands volumes de flux en temps réel. Chaque composant du pipeline assure une étape spécifique : collecte, transformation, validation et stockage des données, permettant un traitement continu, fiable et optimisé pour répondre aux contraintes de temporalité et de volumétrie.",
      "tasks": [
        "Développement et déploiement d'un pipeline de données soumis à des contraintes de vitesse et de volume.",
        "Architecture de solution de données.",
        "Veille technologique et tests de performance.",
        "Équipe de cinq personnes en agile SCRUM."
      ],
      "skills": [
        "kafka",
        "containerisation",
        "docker",
        "etl",
        "git",
        "kubernetes",
        "python",
        "scala"
      ]
    },
    {
      "name": "SOLEX",
      "company": "adeo",
      "role": "Dévelopeur frontend",
      "location": "ronchin",
      "start_date": "10/2019",
      "end_date": "02/2020",
      "context": "Développement d'une interface de gestion d'inventaire multiplateforme.",
      "tasks": [
        "Développement d'une application de gestion d'inventaire multiplateforme.",
        "Adaptation des modèles aux besoins métier.",
        "Équipe de vingt personnes en agile SCRUM.",
        "Développement d'une interface de gestion d'inventaire multiplateforme."
      ],
      "skills": ["dart", "flutter", "frontend", "git"]
    }
  ]
}
